[
    {"code": "0009", "name": "CHARACTER TABULATION", "description": "A tab character, also known as a horizontal tab or simply a tab. It is used to create horizontal space in text."},
    {"code": "000A", "name": "LINE FEED", "description": "A line feed (LF) character, also known as a newline or end-of-line character. It is used to indicate the end of a line of text."},
    {"code": "000B", "name": "LINE TABULATION", "description": "A vertical tab character, used to create vertical space in text."},
    {"code": "000C", "name": "FORM FEED", "description": "A form feed (FF) character, used to advance the paper in printers."},
    {"code": "000D", "name": "CARRIAGE RETURN", "description": "A carriage return (CR) character, used to return the cursor to the beginning of the line."},
    {"code": "0020", "name": "SPACE", "description": "A regular space character as produced by pressing the space bar of your keyboard."},
    {"code": "00A0", "name": "NO-BREAK SPACE", "description": "A fixed space that prevents an automatic line break at its position. Abbreviation: NBSP"},
    {"code": "00AD", "name": "SOFT HYPHEN", "description": "A soft hyphen or syllable hyphen, abbreviated SHY, is a code point for the purpose of breaking words across lines by inserting visible hyphens. It serves as an invisible marker used to specify a place in text where a hyphenated break is allowed without forcing a line break in an inconvenient place if the text is re-flowed. It becomes visible only after word wrapping at the end of a line."},
    {"code": "034F", "name": "COMBINING GRAPHEME JOINER", "description": "A non-printing character used to indicate that adjacent characters should be treated as a single grapheme cluster."},
    {"code": "061C", "name": "ARABIC LETTER MARK", "description": "The Arabic letter mark (ALM) is a non-printing character used in the computerized typesetting of bi-directional text containing mixed left-to-right scripts (such as Latin and Cyrillic) and right-to-left scripts (such as Arabic, Syriac and Hebrew). Similar to Right-to-left mark (RLM), it is used to change the way adjacent characters are grouped with respect to text direction, with some difference on how it affects the bidirectional level resolutions for nearby characters."},
    {"code": "115F", "name": "HANGUL CHOSEONG FILLER", "description": "A placeholder character used in Hangul syllable composition to represent an empty initial consonant."},
    {"code": "1160", "name": "HANGUL JUNGSEONG FILLER", "description": "A placeholder character used in Hangul syllable composition to represent an empty vowel."},
    {"code": "17B4", "name": "KHMER VOWEL INHERENT AQ", "description": "A non-visible character used in Khmer script to indicate an inherent vowel sound 'AQ'."},
    {"code": "17B5", "name": "KHMER VOWEL INHERENT AA", "description": "A non-visible character used in Khmer script to indicate an inherent vowel sound 'AA'."},
    {"code": "180E", "name": "MONGOLIAN VOWEL SEPARATOR", "description": "The MVS is a word-internal thin whitespace that may occur only before the word-final vowels U+1820 MONGOLIAN LETTER A and U+1821 MONGOLIAN LETTER E. It determines the specific form of the character preceding it, selects a special variant shape of these vowels, and produces a small gap within the word. It is no longer classified as space character (i.e. in Zs category) in Unicode 6.3.0, even though it was in previous versions of the standard."},
    {"code": "2000", "name": "EN QUAD", "description": "A 1 en (= 1/2 em) wide space, where 1 em is the height of the current font."},
    {"code": "2001", "name": "EM QUAD", "description": "A 1 em wide space, where 1 em is the height of the current font."},
    {"code": "2002", "name": "EN SPACE", "description": "A 1 en (= 1/2 em) wide space, where 1 em is the height of the current font."},
    {"code": "2003", "name": "EM SPACE", "description": "A 1 em wide space, where 1 em is the height of the current font."},
    {"code": "2004", "name": "THREE-PER-EM SPACE", "description": "A 1/3 em wide space, where 1 em is the height of the current font. 'Thick Space'."},
    {"code": "2005", "name": "FOUR-PER-EM SPACE", "description": "A 1/4 em wide space, where 1 em is the height of the current font. 'Mid Space'."},
    {"code": "2006", "name": "SIX-PER-EM SPACE", "description": "A 1/6 em wide space, where 1 em is the height of the current font."},
    {"code": "2007", "name": "FIGURE SPACE", "description": "A space character that is as wide as fixed-width digits. Usually used when typesetting vertically aligned numbers."},
    {"code": "2008", "name": "PUNCTUATION SPACE", "description": "A space character that is as wide as a period ('.'). Usually used when typesetting vertically aligned punctuation."},
    {"code": "2009", "name": "THIN SPACE", "description": "A 1/6 em - 1/4 em wide space, where 1 em is the height of the current font."},
    {"code": "200A", "name": "HAIR SPACE", "description": "Narrower than the 'THIN SPACE', usually the thinnest space character."},
    {"code": "200B", "name": "ZERO WIDTH SPACE", "description": "Literally a zero-width space character. It is used to indicate a word break opportunity without actually inserting a visible space. It is also used in some programming languages to indicate a non-breaking space."},
    {"code": "200C", "name": "ZERO WIDTH NON-JOINER", "description": "When placed between two characters that would otherwise be connected into a ligature, a ZWNJ causes them to be printed in their final and initial forms, respectively."},
    {"code": "200D", "name": "ZERO WIDTH JOINER", "description": "When placed between two characters that would otherwise not be connected, a ZWJ causes them to be printed in their connected forms (ligature). Also used to join emoji with modifier characters."},
    {"code": "200E", "name": "LEFT-TO-RIGHT MARK", "description": "The left-to-right mark (LRM) is a control character (an invisible formatting character) used in computerized typesetting (including word processing in a program like Microsoft Word) of text that contains a mixture of left-to-right text (such as English and Cyrillic) and right-to-left text (such as Arabic, Syriac and Hebrew). It is used to set the way adjacent characters are grouped with respect to text direction."},
    {"code": "200F", "name": "RIGHT-TO-LEFT MARK", "description": "The right-to-left mark (RLM) is a non-printing character used in the computerized typesetting of bi-directional text containing mixed left-to-right scripts (such as English and Cyrillic) and right-to-left scripts (such as Arabic, Syriac and Hebrew). RLM is used to change the way adjacent characters are grouped with respect to text direction. However, for Arabic script, Arabic letter mark may be a better choice."},
    {"code": "202F", "name": "NARROW NO-BREAK SPACE", "description": "A narrow form of a no-break space, typically the width of a 'THIN SPACE'. Abbreviation: NNBSP."},
    {"code": "205F", "name": "MEDIUM MATHEMATICAL SPACE", "description": "A 4/18 em wide space, where 1 em is the height of the current font. Usually used when typesetting mathematical formulas."},
    {"code": "2060", "name": "WORD JOINER", "description": "A zero width non-breaking space. Abbreviation: WJ. It is used to indicate a word break opportunity without actually inserting a visible space. It is also used in some programming languages to indicate a non-breaking space."},
    {"code": "2061", "name": "FUNCTION APPLICATION", "description": "A contiguity operator indicating application of a function."},
    {"code": "2062", "name": "INVISIBLE TIMES", "description": "The invisible times codepoint is used in mathematical type-setting to indicate the multiplication of two terms without a visible multiplication operator, e.g. when type-setting 2x (the multiplication of the number 2 and the variable x), the invisible times codepoint can be inserted in-between: 2 <U+2062> x ."},
    {"code": "2063", "name": "INVISIBLE SEPARATOR", "description": "A contiguity operator indicating that adjacent mathematical symbols form a list, e.g. when no visible comma is used between multiple indices."},
    {"code": "2064", "name": "INVISIBLE PLUS", "description": "A contiguity operator indicating addition."},
    {"code": "2065", "name": "Invisible operators - undefined", "description": "Undefined symbol in General Punctuation/Invisible Operators."},
    {"code": "206A", "name": "INHIBIT SYMMETRIC SWAPPING", "description": "A control character used to inhibit the symmetric swapping of characters in bidirectional text."},
    {"code": "206B", "name": "ACTIVATE SYMMETRIC SWAPPING", "description": "A control character used to activate the symmetric swapping of characters in bidirectional text."},
    {"code": "206C", "name": "INHIBIT ARABIC FORM SHAPING", "description": "A control character used to inhibit the contextual shaping of Arabic characters."},
    {"code": "206D", "name": "ACTIVATE ARABIC FORM SHAPING", "description": "A control character used to activate the contextual shaping of Arabic characters."},
    {"code": "206E", "name": "NATIONAL DIGIT SHAPES", "description": "A control character used to specify the use of national digit shapes instead of Arabic-Indic digits."},
    {"code": "206F", "name": "NOMINAL DIGIT SHAPES", "description": "A control character used to specify the use of nominal digit shapes instead of national digit shapes."},
    {"code": "3000", "name": "IDEOGRAPHIC SPACE", "description": "A full-width space character used in East Asian typography, typically the width of a full ideographic character."},
    {"code": "2800", "name": "BRAILLE PATTERN BLANK", "description": "The Braille pattern 'dots-0', also called a 'blank Braille pattern', is a 6-dot or 8-dot braille cell with no dots raised. It is represented by the Unicode code point U+2800, and in Braille ASCII with a space. In all Braille systems, the Braille pattern dots-0 is used to represent a space or the lack of content. In particular some fonts display the character as a fixed-width blank. However, the Unicode standard explicitly states that it does not act as a space."},
    {"code": "3164", "name": "HANGUL FILLER", "description": "The Hangul Filler character is used to introduce eight-byte Hangul composition sequences and to stand in for an absent element (usually an empty final) in such a sequence. Unicode includes the Wansung code Hangul Filler in the Hangul Compatibility Jamo block for round-trip compatibility, but uses its own system (with its own, differently used, filler characters) for composing Hangul.<br>This is commonly known as: 'Hangul Filler', 'U+3164', 'Unicode 3164', 'Unique Code 3164', and 'U+1364' (due to the similar code)."},
    {"code": "FEFF", "name": "ZERO WIDTH NO-BREAK SPACE", "description": "The zero width no-break space (ZWNBSP) is a deprecated use of the Unicode character at code point U+FEFF. Character U+FEFF is intended for use as a Byte Order Mark (BOM) at the start of a file. However, if encountered elsewhere, it should, according to Unicode, be treated as a 'zero width no-break space'. The deliberate use of U+FEFF for this purpose is deprecated as of Unicode 3.2, with the word joiner strongly preferred."},
    {"code": "FFA0", "name": "HALFWIDTH HANGUL FILLER", "description": "A halfwidth placeholder character used in Hangul syllable composition to represent an absent element in a sequence."},
    {"code": "FFFC", "name": "OBJECT REPLACEMENT CHARACTER", "description": "The object replacement character (U+FFFC) is a non-printing character used in the computerized typesetting of text. It is used to indicate that an object (such as an image or a video) is to be inserted at that point in the text. The object replacement character is typically used in conjunction with other characters, such as the left-to-right mark (U+200E) and the right-to-left mark (U+200F), to control the directionality of the text."},
    {"code": "1D000", "name": "GLAGOLITIC CAPITAL LETTER BUKY", "description": "A Glagolitic script capital letter used in early Slavic texts."},
    {"code": "1D0F0", "name": "GLAGOLITIC SMALL LETTER YERU", "description": "A Glagolitic script small letter used in early Slavic texts."},
    {"code": "1D100", "name": "GLAGOLITIC CAPITAL LETTER AZU", "description": "A Glagolitic script capital letter used in early Slavic texts."},
    {"code": "1D129", "name": "GLAGOLITIC SMALL LETTER YUS", "description": "A Glagolitic script small letter used in early Slavic texts."},
    {"code": "1D130", "name": "GLAGOLITIC CAPITAL LETTER IZHITSA", "description": "A Glagolitic script capital letter used in early Slavic texts."},
    {"code": "1D13F", "name": "GLAGOLITIC SMALL LETTER YAT", "description": "A Glagolitic script small letter used in early Slavic texts."},
    {"code": "1D140", "name": "GLAGOLITIC CAPITAL LETTER FITA", "description": "A Glagolitic script capital letter used in early Slavic texts."},
    {"code": "1D145", "name": "GLAGOLITIC SMALL LETTER FITA", "description": "A Glagolitic script small letter used in early Slavic texts."},
    {"code": "1D150", "name": "MUSICAL SYMBOL BEGIN BEAM", "description": "A musical notation symbol indicating the start of a beam connecting notes."},
    {"code": "1D159", "name": "MUSICAL SYMBOL NULL NOTEHEAD", "description": "A musical notation symbol representing a null or placeholder notehead."},
    {"code": "1D173", "name": "MUSICAL SYMBOL BEGIN BEAM", "description": "A musical notation symbol indicating the start of a beam connecting notes."},
    {"code": "1D174", "name": "MUSICAL SYMBOL END BEAM", "description": "A musical notation symbol indicating the end of a beam connecting notes."},
    {"code": "1D175", "name": "MUSICAL SYMBOL BEGIN TIE", "description": "A musical notation symbol indicating the start of a tie between notes."},
    {"code": "1D176", "name": "MUSICAL SYMBOL END TIE", "description": "A musical notation symbol indicating the end of a tie between notes."},
    {"code": "1D177", "name": "MUSICAL SYMBOL BEGIN SLUR", "description": "A musical notation symbol indicating the start of a slur."},
    {"code": "1D178", "name": "MUSICAL SYMBOL END SLUR", "description": "A musical notation symbol indicating the end of a slur."},
    {"code": "1D179", "name": "MUSICAL SYMBOL BEGIN PHRASE", "description": "A musical notation symbol indicating the start of a phrase."},
    {"code": "1D17A", "name": "MUSICAL SYMBOL END PHRASE", "description": "A musical notation symbol indicating the end of a phrase."},
    {"code": "E0020", "name": "TAG SPACE", "description": "A tag character used in Unicode for special purposes, such as language tagging."}
]